In [1]:
import pandas as pd

In [5]:
# creating dataframe using lists in list
data = [['Rishi', 80],['Yug', 90],['Pavan', 70],['Vishal', 85],['Tirth', 99]]
data

[['Rishi', 80], ['Yug', 90], ['Pavan', 70], ['Vishal', 85], ['Tirth', 99]]

In [6]:
df = pd.DataFrame(data,index=[1,2,3,4,5], columns=["Name","Marks"])
df

     Name  Marks
1   Rishi     80
2     Yug     90
3   Pavan     70
4  Vishal     85
5   Tirth     99

In [7]:
#creating dataframe using dictonary
data = { "A":[12,25,51], "B":[70,80,90] }
data

{'A': [12, 25, 51], 'B': [70, 80, 90]}

In [9]:
df = pd.DataFrame(data, index=[1,2,3])
df

    A   B
1  12  70
2  25  80
3  51  90

In [10]:
# creating using numpy arrays
import numpy as np

In [11]:
arr = np.array([[1,2],[5,6]])
arr

array([[1, 2],
       [5, 6]])

In [13]:
df = pd.DataFrame(arr, columns=["A","B"])
df

   A  B
0  1  2
1  5  6